EDT/MPCurier/src/Documents/УстановкаСтатусаЗаказаЭкипаж/УстановкаСтатусаЗаказаЭкипаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаЗаказаЭкипаж</name>
  <registerRecords>InformationRegister.СтатусыЗаказов</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереносаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодъема</name>
    <type>
      <types>EnumRef.ВидыПодъемовЗаказаНаЭтаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтажПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БылаПроизведенаПримерка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоSKUПримерки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаборОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаборТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретСменыТипаОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестоваяСреда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаЧерезAssist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенныйКИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУстановленБезКИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодъемногоБрейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаРассчитанная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаПодтвержденная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиЧекаEMAIL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратНаДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/MPCurier/src/Enums/МетодыОплатыПодъемаЗаказа/МетодыОплатыПодъемаЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыОплатыПодъемаЗаказа</name>
  <enumValues>
    <name>ОплачиваетПартнер</name>
  </enumValues>
  <enumValues>
    <name>ОплачиваетКлиент</name>
  </enumValues>
</mdclass:Enum>

EDT/MPCurier/src/Enums/ВидыПодъемовЗаказаНаЭтаж/ВидыПодъемовЗаказаНаЭтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодъемовЗаказаНаЭтаж</name>
  <enumValues>
    <name>БезПодъема</name>
  </enumValues>
  <enumValues>
    <name>Лифт</name>
  </enumValues>
  <enumValues>
    <name>РучнойПодъем</name>
  </enumValues>
</mdclass:Enum>

EDT/MPCurier/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/MPCurier/src/Documents/УстановкаСтатусаЗаказаЭкипаж/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
				
		ЗаполнитьДанныеВводНовогоДокумента();
		
		РассчитатьПодъемНаСервере();
		
		Объект.ВыбранныйТипОплаты = Объект.ТипОплаты;
		ПриСменеВыбранногоТипаОплатыНаСервере();
	КонецеСли;
	СтруктураДанныеЗаказа = ПроцедурыРаботыСЗаказамиВызовСервера.ПолучитьДанныеЗаказа(Объект.Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаКлиенте();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВыбранныйТипОплатыПриИзменении(Элемент)
	ПриСменеВыбранногоТипаОплатыНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеВводНовогоДокумента()
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.ЗаполнитьТоварыПоЗаказу();
	ОбъектДок.ЗаполнитьДаннымиРейса();
	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
КонецПроцедуры


&НаСервере
Процедура ПриСменеВыбранногоТипаОплатыНаСервере()
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.ПолучитьОрганизациюПоТипуОплаты();
	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
КонецПроцедуры	

&НаСервере
Процедура РассчитатьПодъемНаСервере()
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.РассчитатьПодъемНаСервереСПроверкой();
	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхПодъема()
	Если СтруктураДанныеЗаказа.ЗапрашиватьДанныеПодъема Тогда
		Если СтруктураДанныеЗаказа.МетодОплатыПодъема = ПредопределенноеЗначение("Перечисление.МетодыОплатыПодъемаЗаказа.ОплачиваетПартнер") 
		Или Объект.Реализация.МетодыОплатыПодъемаЗаказа.Пустая() 
		Или Объект.ВидПодъема = ПредопределенноеЗначение("Перечисление.ВидыПодъемовЗаказаНаЭтаж.БезПодъема") Тогда
			Если Объект.ВидПодъема = ПредопределенноеЗначение("Перечисление.ВидыПодъемовЗаказаНаЭтаж.БезПодъема") Тогда
				Элементы.ГруппаДанныеПодъема.Видимость = Ложь; 
			Иначе
				Элементы.ГруппаДанныеПодъема.Видимость = Истина; 
			КонецеСли;	
			Элементы.ДекорацияКлиентПодъемНеОплачивает.Видимость = Истина;
			//Элементы.ГруппаПодъемОплачиваетКлиент.Видимость = Ложь;
		Иначе		
			Элементы.ГруппаПодъем.Видимость = Истина;
			Элементы.ДекорацияКлиентПодъемНеОплачивает.Видимость = Ложь;
			//Элементы.ГруппаПодъемОплачиваетКлиент.Видимость = Истина;
		КонецеСли;	
	Иначе
		Элементы.ГруппаДанныеПодъема.Видимость = Ложь;
		Элементы.ДекорацияКлиентПодъемНеОплачивает.Видимость = Истина;
		//Элементы.ГруппаПодъемОплачиваетКлиент.Видимость = Ложь;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииНаКлиенте()
	Если Объект.ТипОплаты = ПредопределенноеЗначение("Справочник.ТипыОплат.Терминал") 
		Или Объект.ТипОплаты = ПредопределенноеЗначение("Справочник.ТипыОплат.Наличные") Тогда
		Элементы.ВыбранныйТипОплаты.Видимость = Истина;
	Иначе
		Элементы.ВыбранныйТипОплаты.Видимость = Ложь;
	КонецеСли;	
	
	Если СтруктураДанныеЗаказа.ЗапретСменыТипаОплаты Тогда
		Элементы.ДекорацияСменаТипаОплаты.Видимость = Истина;
	Иначе
		Элементы.ДекорацияСменаТипаОплаты.Видимость = Ложь;
	КонецеСли;	
	
	Если СтруктураДанныеЗаказа.ЗапретЧастичногоВыкупа Тогда
		Элементы.ДекорацияОсновная.Видимость = Ложь;
		Элементы.ДекорацияИтогоСКлиента.Видимость = Истина;
		Элементы.Товары.Доступность = Ложь;
	Иначе
		Элементы.ДекорацияОсновная.Видимость = Истина;
		Элементы.ДекорацияИтогоСКлиента.Видимость = Ложь;		
		Элементы.Товары.Доступность = Истина;
	КонецеСли;	
	Если СтруктураДанныеЗаказа.ПечататьЧек Тогда
		Элементы.АдресОтправкиЧекаEMAIL.Видимость = Истина;
	Иначе
		Элементы.АдресОтправкиЧекаEMAIL.Видимость = Ложь;
	КонецЕсли;	
	УстановитьВидимостьДанныхПодъема();
КонецПроцедуры	


//&НаСервере
//Процедура ПриОткрытииНаСервере()
//	Если Объект.Реализация.ЧастичныйВыкупЗапрещен Тогда
//		Элементы.ДекорацияОсновная.Видимость = Ложь;
//		Элементы.ДекорацияИтогоСКлиента.Видимость = Истина;
//		Элементы.ДоставленныеТовары.Доступность = Ложь;
//	Иначе
//		Элементы.ДекорацияОсновная.Видимость = Истина;
//		Элементы.ДекорацияИтогоСКлиента.Видимость = Ложь;		
//		Элементы.ДоставленныеТовары.Доступность = Истина;
//	КонецеСли;
//	
//	Если Объект.Реализация.СменаТипаОплатыЗапрещена Тогда
//		Элементы.ДекорацияСменаТипаОплаты.Видимость = Истина;
//	Иначе
//		Элементы.ДекорацияСменаТипаОплаты.Видимость = Ложь;
//	КонецеСли;
//	
//	
//	Если Объект.ТипОплаты = Справочники.ТипыОплат.Терминал Или Объект.ТипОплаты = Справочники.ТипыОплат.Наличные Тогда
//		Элементы.ТипОплаты.Видимость = Истина;
//	Иначе
//		Элементы.ТипОплаты.Видимость = Ложь;
//	КонецеСли;
//	
//	Если Объект.Реализация.ПечататьЧек Тогда
//		Элементы.АдресОтправкиЧека.Видимость = Истина;
//	Иначе
//		Элементы.АдресОтправкиЧека.Видимость = Ложь;
//	КонецЕсли;	
	
	
//	УстановитьВидимостьДанныхПодъема();
	
//	Элементы.СуммаНал.Заголовок = Объект.ТипОплаты.Наименование;
//	Элементы.кнОплатитьСтоимостьДоставки.Видимость = Объект.Реализация.ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа;	
//	
//	Если Объект.СуммаПредоплаты <> 0 Тогда
//		Элементы.ГруппаПредоплата.Видимость = Истина;
//	Иначе
//		Элементы.ГруппаПредоплата.Видимость = Ложь;
//	КонецеСли;
//	
//	Если Объект.Реализация.Рейс.ВыданТерминалAssist Тогда
//		Объект.ОплатаЧерезAssist = Истина;		
//	КонецеСли;

	
//КонецПроцедуры
#КонецОбласти
